tap "nikitabobko/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Simple terminal UI for git commands
brew "lazygit"
# Deep clean and optimize your Mac
brew "mole"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Next-generation plugin manager for zsh
brew "zplug"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Utility to hide menu bar items
cask "hiddenbar"
# Clipboard manager
cask "maccy"
# App to write, plan, collaborate, and get organised
cask "notion"
# Screenshot measurement and annotation tool
cask "shottr"
# System monitor for the menu bar
cask "stats"
npm "prettier"
